
# EMP & DEPT Case Study


## Create DEPT Table

In [ ]:

CREATE TABLE dept (
    deptno INT PRIMARY KEY,
    dname  VARCHAR(14) NOT NULL,
    loc    VARCHAR(13)
);


## Create EMP Table

In [ ]:

CREATE TABLE emp (
    empno    INT PRIMARY KEY,
    ename    VARCHAR(10) NOT NULL,
    job      VARCHAR(9)  NOT NULL,
    mgr      INT,
    hiredate DATE NOT NULL,
    sal      DECIMAL(7,2) CHECK (sal > 0),
    comm     DECIMAL(7,2),
    deptno   INT,
    CONSTRAINT fk_deptno FOREIGN KEY (deptno) REFERENCES dept(deptno)
);


## Insert Records into DEPT

In [ ]:

INSERT INTO dept VALUES
(10,'ACCOUNTING','NEW YORK'),
(20,'RESEARCH','DALLAS'),
(30,'SALES','CHICAGO'),
(40,'OPERATIONS','BOSTON');


## Insert Records into EMP

In [ ]:

INSERT INTO emp VALUES
(7369,'SMITH','CLERK',7902,'1980-12-17',800.00,NULL,20),
(7499,'ALLEN','SALESMAN',7698,'1981-02-20',1600.00,300.00,30),
(7521,'WARD','SALESMAN',7698,'1981-02-22',1250.00,500.00,30),
(7566,'JONES','MANAGER',7839,'1981-04-02',2975.00,NULL,20),
(7654,'MARTIN','SALESMAN',7698,'1981-09-28',1250.00,1400.00,30),
(7698,'BLAKE','MANAGER',7839,'1981-05-01',2850.00,NULL,30),
(7782,'CLARK','MANAGER',7839,'1981-06-09',2450.00,NULL,10),
(7788,'SCOTT','ANALYST',7566,'1982-12-09',3000.00,NULL,20),
(7839,'KING','PRESIDENT',NULL,'1981-11-17',5000.00,NULL,10),
(7844,'TURNER','SALESMAN',7698,'1981-09-08',1500.00,0.00,30),
(7876,'ADAMS','CLERK',7788,'1983-01-12',1100.00,NULL,20),
(7900,'JAMES','CLERK',7698,'1981-12-03',950.00,NULL,30),
(7902,'FORD','ANALYST',7566,'1981-12-03',3000.00,NULL,20),
(7934,'MILLER','CLERK',7782,'1982-01-23',1300.00,NULL,10);


## Sample Queries

In [ ]:

SELECT ename, sal, sal * 12 AS annual_salary
FROM emp
WHERE sal * 12 > 30000;

In [ ]:

SELECT deptno, COUNT(*) AS emp_count
FROM emp
GROUP BY deptno
HAVING COUNT(*) > 3
ORDER BY emp_count ASC;


## Assignment
- Retrieve employees whose job role is either SALESMAN or ANALYST.
- Retrieve employees whose names start with the letter 'M'.
- Retrieve employees hired in the year 1981.
- Retrieve minimum and maximum salary per department.
- Retrieve employees who were hired on a Thursday.
- Retrieve departments having more than 3 employees.
- Calculate the number of months each employee has worked.